// let age = 28;

// // string - "string" 'string'
// // number - -10, 10, 0, 4.5
// // boolean - true/false
// // null - empty
// //undefined - присутність

// let a;

// console.log(a); //undefined

// console.log(typeof "10"); //string

// console.log( 5 == "5"); //true
// console.log(7 === "7"); //false
// console.log(10 >= 10); //true
// console.log(10 % 3); //1
// console.log(15 % 13); //2
// console.log(100 % 2); //0

// //! =============================

// Явне зведення типів

// Number() - намагаеться перетворити будь-що на число
// String() - намагаеться перетворити будь-що на строку
// Boolean() - намагаеться перетворити буль-що на буліан

// let number = Number(prompt("Введіть будь яке число від 1 до 10."))

// console.log(number + 4);

// console.log(Number("Hello"));
// console.log(String(100));
// console.log(Boolean(" "));

/*
True: Будь яка числа чи число (ціле, дробове, від'ємне), крім нуля | будь-яка строка з символами | 
False: 0, пуста строка, null, undefined
*/

//!==================================

// Неявне зведення типів
// ==
// + - унарний плюс( неявно перетворює на число)
// + "" - неявне перетворення на строку
// !! - неявне перетворення на Boolean

// console.log(+"15");
// console.log(150 + "");

//!====================================

//? Логічні оператори

//* Логічне НІ - ! - змінює логічний тип на зворотній (був тру - стане фолз і навпаки)

// console.log(!true)
// console.log(!false)

// console.log(!0) // true | 0 -> false -> !false -> true

// console.log(!" ") // false | " " -> true -> !true -> false

// console.log(!-69) // false | -69 -> true -> !true -> false

// console.log(!!"") // false | "" -> false -> !(!false) -> !true -> false

//* Логічне АБО - || > повертає перший true з переліку, якщо на одного true не знайдено - повертає останній

// console.log(0 || 4 || false); // false
// console.log("" || false || " " || undefined); // " "
// console.log(false || "" || null || 0); // 0

//* Логічне І - && > повертає перший false з переліку, якщо ні одного false не знайдено - повертає останній
// console.log( 4 && -9 && true && 0 && "hello"); // 0
// console.log(10 && " " && "0" && -1 && false && null); // false
// console.log(true && 1 && "null" && " " && -9); //-9

// console.log( 4|| (0 && 1) || "000"); //4|| 0 || "000" > 4
// console.log("І" || ("hate" && "love") || 5); //І

// console.log(0 || (1 && null && false) || 5 || -9); // 5

//  1. (1 && null && false) > null

/*
1. запитайте у користувача два числа 
2. потрібно вивести сумму, різницю, добуток, і ділення цих двух чисел (можна в консоль,
можна в алерт)
*/

// let first = Number(prompt("введіть перше число"));
// let second = Number(prompt("введіть друге число"));
// console.log(first + second);
// console.log(first - second);
// console.log(first * second);
// console.log(first / second);

//!======================================================
//*Розгалудження (if, else switch case)

// if (умова){
//     тіло умови, якщо умова істинна(true) - виконуемо тіло умови, якщо умова хибна (false), то не виконуемо
// } else{
//     тіло улсе, викоуеться тоді, коли іф не спрацював
// }

//=======================================================

// if (number > 0) {
//   //   alert("Число " + number + " більше за 0!");
//   alert(`Число ${number} більше за 0!`);
// } else if (number === 0) {
//   alert("Ви ввели 0");
// } else {
//   //   alert("Число " + number + " менше за 0!");
//   alert(`Число ${number} менше за 0!`);
// }

//!========
// запитайте у користувача юзернейм і пароль. Потім зробіть перевірку на правильність паролю, якщо пароль дорівнює "admin" - то це правильний пароль і потрібно привітатись з юзером(повідомлення Привіт! Імʼя). Якщо пароль неправильний - вивести повідомлення "Неправильний пароль"

// let userName = prompt("Введіть свое ім'я.")
// let password = prompt("Введіть пароль.")

// if (password === "qwer"){
//     alert("привіт " + userName)
// } else {alert( "пароль не вірний.")}

//!========================
// let userDrink = Number(
//   prompt("Вберіть напій: 1 - кава, 2 - чай, 3 - мілкшейк.")
// );

// if (userDrink === 1) {
//   alert("Ви вибрали каву!");
// } else if (userDrink === 2) {
//   alert("Ви вибрали чай!");
// } else if (userDrink === 3) {
//   alert("Ви вибрали мілкшейк!");
// } else {
//   alert("Такого напою не існує!");
// }

// // switch case відповідає за суворе порівняння кейсів з значенням

// switch (userDrink) {
//   case 1:
//     alert("Ви вибрали каву!");
//     break;
//   case 2:
//     alert("Ви вибрали чай!");
//     break;
//   case 3:
//     alert("Ви вибрали мілкшейк!");
//     break;
//   default:
//     alert("Такого напою не існує!");
// }

//!==========

/*
Потрібно запитати у користовача два числа(в різні промпти), після чого запитати математичну операцію (+, -, /, *). За допомогомою конструкції switch case потрібно визначити який знак вибрав юзер і порахувати вираз.
*/
