// якщо число негативне - то вивести: Число негативна
// якщо число позитивне - то вивести: Число позитивне
// якщо число 0 - то вивести: Число 0

// let number = 0;

// if (number === 0) {
//   console.log("Ви вибрали 0");
// } else if (number < 0) {
//   console.log("Ви вибрали негативне число");
// } else {
//   console.log("Ви вибрали позитивне число");
// }

// //!====================================

// for (let i = 1; i <= 10; i += 1){
//     console.log(`${i}Hello world`);
// }

//for (Старт циклу; умова продовження циклу; крок циклу)

// for ( let i = 10; i >= 1; i -= 1){
//     console.log(i)
// }

// let count = 0;
// // for (let i = 2; i <= 100; i += 2) {
// //   console.log(i);
// //   count += 1;
// // }

// for (let i = 1; i <= 100; i += 1) {
//   if (i % 2 == 0) {
//     console.log(i);
//   }
//   count += 1;
// }

// console.log (`Ітерацій: ${count}`);

//!=====================================

// while - виконується до тих пір поки умова буде true (часто використовується тоді, коли ми не знаємо кількість ітерацій)

// while (умова) { тіло циклу - буде виконуватись тоді, коли умова буде true, якщо умова буде false - цикл завершується }

// let word = "карусель";

// let userWord = prompt("Я загадав слово! Спробуй його вгадати: ");

// while (word !== userWord) {
//   userWord = prompt("Невірно! Спробуй ще раз: ");
// }

// alert("Ти вгадав, вітаю!");

// let username = prompt("Будь ласка введіть свій нік нейм:");

// if (username !== "") {
//   if (username === "admin") {
//     let password = prompt("Будь ласка введіть пароль:");
//     while (password !== "admin"){
//         password = prompt("Пароль не вірний спробуйте ще раз.")
//     }

//     alert("Вітаю ви ввійшли в акаунт.");
//   } else {
//     alert("Привіт, " + username + "!");
//   }
// } else {
//   alert("Помилка: Ви нічого не ввели.");
// }

